app/Http/Controllers/Auth/RegisteredUserController.php

insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('TESTING MASTER', 'test@abv.bg', '$2y$12$OU9u33ESOCznVGQNE46IA.EYr2bo8CXXjAmn7cG.x7uG7R/RkYiOC', '2024-07-22 13:19:07', '2024-07-22 13:19:07') returning "id"
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);