app/Http/Controllers/ProfileController.php

update "users" set "name" = 'TESTING MASTE', "updated_at" = '2024-07-22 12:18:54' where "id" = 1
---
    public function update(ProfileUpdateRequest $request): RedirectResponse
    {
        $request->user()->fill($request->validated());

        if ($request->user()->isDirty('email')) {
            $request->user()->email_verified_at = null;
        }

        $request->user()->save();